Repository: AndreyShor/Angular_front_asinfo
Catalog: src/locale/messages.*.xlf
Languages: ru

# nav_home
source: Home
ru: Главная

# nav_abme
source: About Me
ru: Обо мне

# nav_por
source: Portfolio
ru: Портфолио

# nav_contact
source: <a> Contacts </a>
ru: Контакты

# lang_option_ru
source: Russian
ru: Русский

# lang_option_lv
source: Latvian
ru: Latvijas

# title_1
source: About Me
ru: Обо мне

# home_par_1
source: Hi, I am a full stack web developer with 5 years of experience in IT. I am passionate about building excellent software that improves the lives of those around me. I specialize in creating software for clients ranging from individuals and small-businesses all the way to large enterprise corporations. I have several years of experience in front-end development and just started in this year to work on back-end side with Node.js framework developed by Google. I am using in development process the range of different technologies from basic HTML and CSS till single page frameworks like Angular with TypeScript, RxJs and Node.js with Express, also I have several experience in NoSQL database like MongoDB and in SQL databases like MySQL.
ru: Привет, я веб-разработчик с 5-летним опытом работы в IT. Я увлечен созданием превосходного программного обеспечения, которое улучшает жизнь тех, кто меня окружает. Я специализируюсь на создании программного обеспечения для клиентов - от частных лиц и малых предприятий до крупных корпоративных корпораций. У меня есть несколько лет опыта в разработке в области front-end, и я начал в этом году работать над back-end с Node.js, разработанным Google. В процессе разработки я использую различные технологии, от базового HTML и CSS до одностраничных фреймворков, таких как Angular с TypeScript, RxJs и Node.js с Express, а также у меня есть опыт работы с базами данных NoSQL, такими как MongoDB, и базами данных SQL, такими как MySQL.

# home_par_2
source: Also, I have had experience on working in design of UI/UX architecture for application and usually I am take the major goal to make user-friendly interface for application to make it easily to use for final consumer and improve the productivity of workers on enterprise side to decrease production costs and increase profit for company. The passion to make good UX architecture gave me such books as “Don't Make Me Think” - Steve Krug and “Design of familiar things” - Donald Norman. I have good skills in Adobe Photoshop and Adobe XD (Nowadays I prefer more it for work)
ru: Кроме того, у меня был опыт работы по разработке архитектуры UI / UX для приложений, и обычно я ставлю перед собой главную цель - создать удобный для пользователя интерфейс для приложения, чтобы его было легко использовать для конечного потребителя и повысить производительность труда работников на предприятии. Стороной снижения себестоимости продукции и увеличения прибыли для компании. Страсть к созданию хорошей UX-архитектуры дала мне такие книги, как «Не заставляй меня думать» - Стив Круг и «Дизайн знакомых вещей» - Дональд Норман. У меня есть хорошие навыки в Adobe Photoshop и Adobe XD (в настоящее время я предпочитаю больше его для работы)

# home_par_3
source: Final thing about my experience is an Economics and Finance knowledge. While I was studying in College and taking A level program in Economics and finance, I have fully understand all basic macro and micro economics concepts which in my case was from Theory of the Firms(Perfect Competition, monopoly, monopsony and etc) till Global Markets(Fiscal Policy and others 2, protectionism, exchange rate mechanism and regulation of all it ) with Financial Markets(Money Market, Capital Market, bonds, shares and stocks, QE, Basel III and go on ). I have several experience in working in different start-ups and fully understand how hard to create good working business structure and can help you to don’t make mistakes on the beginning of your business or if your are big, just give small advice if you will ask me of course :) .
ru: Последняя вещь в моем опыте - знание экономики и финансов. Когда я учился в колледже и изучал программу A Level по экономике и финансам, я полностью понимаю все основные концепции макро- и микроэкономики, которые в моем случае были от теории фирм (совершенная конкуренция, монополия, монопсония и т. д.) до глобальных рынков (Фискальная политика и другие 2, протекционизм, механизм обменного курса и регулирование всего этого) с финансовыми рынками (денежный рынок, рынок капитала, облигации, акции и акции, QE, Базель III и т. д.). У меня есть опыт работы в разных стартапах, и я прекрасно понимаю, насколько сложно создать хорошую работающую бизнес-структуру, и я могу помочь вам не ошибиться в начале вашего бизнеса или, если вы большой, просто дать небольшой совет, если вы спросит меня конечно :).

# home_skill_1
source: Web design
ru: Веб-дизайн

# home_skill_parag_1
source: Ready to make your design.
ru: Готов сделать ваш дизайн.

# home_skill_2
source: Development
ru: Разработка

# home_skill_parag_2
source: Black-to-Light Creation
ru: Создание продукта от сложного к простому

# home_skill_3
source: Economics
ru: Экономика

# home_skill_parag_3
source: Necessary skill in modern times
ru: Необходимый навык в наше время

# home_skill_4
source: Marketing
ru: Маркетинг

# home_skill_parag_4
source: Promotion it is just start
ru: Продвижение это только начало

# title_2
source: Projects
ru: Проекты

# title_3
source: Contact
ru: Контакты

# contact_phone
source: Phone
ru: Телефон

# contact_email
source: E-mail
ru: Эл. почта

# contact_adress
source: Address
ru: Адрес

# contact_my_adress
source: Latvia, Riga
ru: Латвия, Рига

# contact_send
source: Send
ru: Отправить

# about_name
source: Andrey Shorstkin
ru: Андрей Шорсткин

# about_par_1
source: My name is Andrey. I am European Union citizen and was born in Riga, Latvia. I am speaking on 3 languages. It is English, Russian and Latvian. I have started learning programming in 15 years old and I immediately realized that programming is the thing of my life. I have had several hobbies like gym, finance sciences and rock climbing. I am already have had experience in working in several companies like my last job in Arcona ltd. where I was front-end developer and designer. Also, I have experience in working and studying in different fields of computer science: Web Development, Mechanical engineering with Robotics and desktop application creation with Object Pascal е. <br/> <br/> I have finish GSCE A level program where I was studying Economics, Mathematics in depth and Geography(Human and Physical) <br/> Nowadays I am studying in the Essex University and I am taking BSc degree in Computer Science. As an developer I am focus on Full stack development in web, but personally I am quite interesting in AI and Machine Learning and Big data
ru: Меня зовут Андрей. Я гражданин Европейского Союза и родился в Риге, Латвия. Я говорю на 3 языках. Это английский, русский и латышский языки. Я начал изучать программирование в 15 лет, и я сразу понял, что программирование - вещь моей жизни. У меня было несколько увлечений, таких как спортзал, финансы и скалолазание. У меня уже был опыт работы в нескольких компаниях, таких как моя последняя работа в Arcona ltd. где я был фронт-энд разработчиком и дизайнером. Кроме того, у меня есть опыт работы и обучения в различных областях компьютерных наук: веб-разработка, машиностроение с робототехникой и создание настольных приложений с использованием Object Pascal. <br/> <br/> Я закончил программу GCSE A level, где я изучал экономику, математику и географию (человек и физика) <br/> В настоящее время я учусь в университете Эссекса, и я получаю степень бакалавра в области компьютерных наук. Как разработчик, я занимаюсь разработкой полного стека в веб-индустрии, но лично мне очень интересны такие темы, как ИИ, машинное обучение и большие данные.

# about_educ_header
source: Education
ru: Образование

# about_educ_s_1
source: Rigas 80. Secondary School
ru: Рига 80. Средняя школа

# about_educ_s_2
source: Progmesisters
ru: Progmeistars

# about_educ_s_3
source: Earlscliffe college
ru: Эрлслиффский колледж

# about_educ_s_4
source: Essex University
ru: Университет Эссекса

# about_contact
source: CONTACT
ru: контакты

# portfo_page_title
source: Projects
ru: Портфолио

# portfo_moreP
source: New projects in development
ru: Новые проекты в разработке

# portfo_desc_1
source: It is 2 web sites for pharmaceutical company. My role was design and coding front-end and partially back-end . Me aim was to simplify hard information about the product and make it possible to understand the basics concepts about the product in 5 min time of visiting the web site by using UI and UX skills. Also, We was using “pug” and “sass” on frontend and “Node.js” with “express” on the beck-end of development.
ru: Это 2 сайта для фармацевтической компании. Моей ролью был дизайн и кодирование внешнего интерфейса и частично внутреннего интерфейса. Моя цель состояла в том, чтобы упростить точную информацию о продукте и позволить понять основные понятия о продукте за 5 минут времени посещения веб-сайта, используя навыки UI и UX. Кроме того, мы использовали «pug» и «sass» во внешнем интерфейсе и «Node.js» с «express» в beck-end разработки.

# portfo_button
source: MORE
ru: БОЛЬШЕ

# portfo_desc_2
source: It’s my own web site portfolio and resume. All front-end was done on Angular with Angular Material framework, SASS and ExJs for front-end logic. All back-end part was done with Node.js with Express framework and as a data-base for blog and admin menu was taken MongoDb
ru: Это мое собственное портфолио и резюме. Весь интерфейс был сделан на Angular с каркасом Angular Material, SASS и ExJs для логики интерфейса. Вся внутренняя часть была сделана с Node.js с платформой Express и в качестве базы данных для блога и меню администратора была взята MongoDb
